#include <stdio.h>

int main() {               //ประกาศตัวแปร a,b,c,d,e,f
    float a = 0.617;
    int b = 25;
    float c = 19.0;
    int d = 9;
    float e = 124.555;
    float f = 0.001;

printf("a=%6.3f%%\n", a);   //แสดงตัวแปร a กว้าง6ช่อง ทศนิยม3ตำแหน่ง
printf("b=%4d%%\n", b);     //แสดงตัวแปร b กว้าง4ช่อง
printf("c =%6.3f%%\n", c);  //แสดงตัวแปร c กว้าง6ช่อง ทศนิยม3ตำแหน่ง
printf("d  =%d%%\n", d);    //แสดงตัวแปร d 
printf("e=%7.3f%%\n", e);   //แสดงตัวแปร e กว้าง7ช่อง ทศนิยม3ตำแหน่ง
printf("f=%.3f%%\n", f);    //แสดงตัวแปร f ทศนิยม3ตำแหน่ง

return 0;                   // สิ้นสุดการทำงาน
}
